#pragma once
#include "Resource.h"

//--------------------------------------------------------------------------------------------------------------------------------------
//목  적 : 동기화 criticalsection 클래스
//작성자 : 이원배
//일  시 : 2020. 12. 01
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------
class cCriticalSection
{
public:
	cCriticalSection();
	~cCriticalSection();

	// criticalsection 해제
	void UnLock();

	// criticalsection 설정
	void Lock();
private:
	CRITICAL_SECTION mCriticalSection;
};

